In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

# Looking into the data

In [2]:
df_employee = pd.read_csv('employee.csv')

In [3]:
df_employee

,EmployeeId,CommuteDistance,DegreeCompleted,DegreeField,Department,EmploymentEndDate,EmploymentEndReason,EmploymentStartDate,Gender,JobLevel,MaritalStatus,NumPreviousCompanies,NumYearsWorked,OvertimeDays,OvertimeHours,Salary,TrainingsAttended,TravelFrequency,WeeklyHoursBudgeted,YearOfBirth
0,1001,10,Master,Business,Accounting,NaN,NaN,12/12/2014,Female,4,Married,2.0,13,1,2,96800,0,None,40,1980
1,1002,7,Master,Other,Other,NaN,NaN,10/10/2017,Female,2,Single,2.0,12,1,5,60400,1,Monthly,40,1986
2,1003,9,Bachelor,Business,Other,3/8/2019,Retired,7/23/2014,Male,2,Married,NaN,5,4,15,49100,2,No travel,40,1992
3,1004,8,Master,Other,Marketing,NaN,NaN,5/8/2014,Male,2,Single,1.0,15,1,3,47100,0,No travel,40,1979
4,1005,7,Master,Computer Science,Marketing,NaN,NaN,12/24/2013,Male,4,Single,2.0,16,4,12,58700,1,Monthly,40,1979
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1996,2997,12,Master,Business,Accounting,12/17/2019,Went to another company,4/11/2011,Male,3,Married,4.0,42,15,26,207300,2,Monthly,40,1952
1997,2998,17,Master,Finance,Other,NaN,NaN,2/25/2017,Female,1,Married,2.0,11,2,4,53300,1,Monthly,40,1982
1998,2999,3,Master,Marketing,Other,NaN,NaN,10/2/2014,Male,3,Single,3.0,22,2,6,89300,3,Monthly,40,1972
1999,3000,8,Bachelor,Other,Other,NaN,NaN,7/29/2014,Female,3,Married,2.0,18,3,11,79300,4,monthly,40,1978
2000,3001,10,Bachelor,Other,Other,NaN,NaN,12/17/2015,Male,1,Divorced,2.0,19,12,28,67500,0,No travel,40,1974

In [4]:
df_employee.columns

Index(['EmployeeId', 'CommuteDistance', 'DegreeCompleted', 'DegreeField',
       'Department', 'EmploymentEndDate', 'EmploymentEndReason',
       'EmploymentStartDate', 'Gender', 'JobLevel', 'MaritalStatus',
       'NumPreviousCompanies', 'NumYearsWorked', 'OvertimeDays',
       'OvertimeHours', 'Salary', 'TrainingsAttended', 'TravelFrequency',
       'WeeklyHoursBudgeted', 'YearOfBirth'],
      dtype='object')

In [5]:
df_perfrev = pd.read_csv('performancereview.csv')

In [6]:
df_perfrev

      EmployeeId  ReviewDate  PerformanceRating
0           1001  12/14/2015                  3
1           1001  12/13/2016                  3
2           1001  12/13/2017                  3
3           1001  12/13/2018                  3
4           1001  12/13/2019                  3
...          ...         ...                ...
8481        3000   7/30/2019                  4
8482        3001  12/16/2016                  3
8483        3001  12/18/2017                  3
8484        3001  12/18/2018                  2
8485        3001  12/18/2019                  1

[8486 rows x 3 columns]

In [7]:
df_survey = pd.read_csv('survey.csv')

In [8]:
df_survey

,EmployeeId,QuestionNum,QuestionText,Response
0,1001,Q1,How satisfied are you with your job?,Very Satisfied
1,1001,Q2,How satisfied are you with the company?,Neither Satisfied nor Unsatisfied
2,1001,Q3,How satisfied are you with your manager?,Somewhat Satisfied
3,1001,Q4,How would you rate you work/life balance?,Excellent
4,1002,Q1,How satisfied are you with your job?,Very Satisfied
...,...,...,...,...
7999,e3000,Q4,How would you rate you work/life balance?,Good
8000,E3001,Q1,How satisfied are you with your job?,Somewhat Satisfied
8001,E3001,Q2,How satisfied are you with the company?,Neither Satisfied nor Unsatisfied
8002,E3001,Q3,How satisfied are you with your manager?,Somewhat Satisfied
8003,E3001,Q4,How would you rate you work/life balance?,Fair

In [9]:
# Initial thoughts:
# - df's have common 'EmployeeId' column 
# - df_employee has single row entry for each 'EmployeeId' can use this to combine with other df's later
# - df_perfrev has multiple entries for each 'EmployeeId' that are date dependent. Maybe use groupby + avg() to get single row.
# - df_survey has multiple entries based on responses for Q1, Q2, Q3, Q4. Could assign 'Reponse' text values as numbers 
# i.e. Very Satisfied = 5... In order to put this into a final merged df, will have to convert Q1, Q2, Q3, Q4 to columns
# - df_survery also has entries with suffixes in fromt of 'EmployeeId', 'E' or 'e' will need to remove

# Performance Review df

In [10]:
df_perfrev.columns

Index(['EmployeeId', 'ReviewDate', 'PerformanceRating'], dtype='object')

In [11]:
df_perfrev['PerformanceRating'].unique()
# Ratings are 1 through 5

array([3, 4, 2, 5, 1], dtype=int64)

In [12]:
# I am going to drop ReviewDate column using groupby, 
# I think this will be OK. Since 'Performance Rating' are int's we will take average

In [13]:
df_perfrev = df_perfrev.groupby(['EmployeeId'], dropna=False).mean().reset_index()
df_perfrev
# reset_index() so can merge later with other dataframes

      EmployeeId  PerformanceRating
0           1001              3.000
1           1002              3.500
2           1003              3.000
3           1004              3.600
4           1005              3.000
...          ...                ...
1627        2997              3.125
1628        2998              3.000
1629        2999              3.000
1630        3000              3.400
1631        3001              2.250

[1632 rows x 2 columns]

# Survey df

In [14]:
# First remove the 'E' and 'e' prefixes
df_survey['EmployeeId'] = df_survey['EmployeeId'].str.replace('E', '')
df_survey['EmployeeId'] = df_survey['EmployeeId'].str.replace('e', '')

In [15]:
# Next going to figure out how many unique responses there are:
df_survey['Response'].unique()

array(['Very Satisfied', 'Neither Satisfied nor Unsatisfied',
       'Somewhat Satisfied', 'Excellent', 'Good', 'Poor', 'Fair',
       'Very Unsatisfied', 'Somewhat Unsatisfied', 'Very Poor'],
      dtype=object)

In [16]:
# Seems like there is 2 groups here, 1) ratings and 2) satisfactions

In [17]:
# Assign a numerical value to each, create dictionary
dict1 = {
            'Very Satisfied' : 5,
            'Somewhat Satisfied' : 4,  
            'Neither Satisfied nor Unsatisfied' : 3,
            'Somewhat Unsatisfied' : 2,
            'Very Unsatisfied' : 1,
}

dict2 = {
            'Excellent' : 5,
            'Good' : 4,
            'Fair' : 3,
            'Poor' : 2,
            'Very Poor' : 1,
}

In [18]:
# Replace values with dictionary values
df_survey = df_survey.replace(dict1)
df_survey = df_survey.replace(dict2)

In [19]:
df_survey

,EmployeeId,QuestionNum,QuestionText,Response
0,1001,Q1,How satisfied are you with your job?,5
1,1001,Q2,How satisfied are you with the company?,3
2,1001,Q3,How satisfied are you with your manager?,4
3,1001,Q4,How would you rate you work/life balance?,5
4,1002,Q1,How satisfied are you with your job?,5
...,...,...,...,...
7999,3000,Q4,How would you rate you work/life balance?,4
8000,3001,Q1,How satisfied are you with your job?,4
8001,3001,Q2,How satisfied are you with the company?,3
8002,3001,Q3,How satisfied are you with your manager?,4
8003,3001,Q4,How would you rate you work/life balance?,3

In [20]:
# I don't think we need 'QuestionText' column anymore...
# I think we can now group by EmployeeId and QuestionNum, this will drop QuestionText column anyway
df_survey = df_survey.groupby(['EmployeeId', 'QuestionNum'], dropna=False).agg('mean').reset_index()
df_survey

     EmployeeId QuestionNum  Response
0          1001          Q1       5.0
1          1001          Q2       3.0
2          1001          Q3       4.0
3          1001          Q4       5.0
4          1002          Q1       5.0
...         ...         ...       ...
7999       3000          Q4       4.0
8000       3001          Q1       4.0
8001       3001          Q2       3.0
8002       3001          Q3       4.0
8003       3001          Q4       3.0

[8004 rows x 3 columns]

In [21]:
# There's probably a quicker way to do this, but I want to make a column for Q1, Q2, Q3, and Q4
# I am just going to make 4 x dataframes 
# Going to rename 'Response' column as "QX" for merge later and drop 'QuestionNum'

In [22]:
questions = ['Q1','Q2','Q3','Q4']
df_list = list()
for i in questions:
    df = pd.DataFrame()
    df = df_survey.loc[lambda df: df['QuestionNum'] == i]
    df = (
        df
        .rename(columns ={'Response' : i})
        .drop(columns = 'QuestionNum')
    )
    df_list.append(df)

In [23]:
df_survey_Q1 = df_list[0]
df_survey_Q2 = df_list[1]
df_survey_Q3 = df_list[2]
df_survey_Q4 = df_list[3]

In [24]:
# Now we are in a spot where we can merge all dataframes on EmployeeId

# Merging df's

In [25]:
df_merge = pd.merge(df_employee, df_perfrev, on = 'EmployeeId', how='outer')
# Got an error on next line, checked dtypes for Employee Id in both dataframes one is int64, other text
# Need to add extra line to convert one or the other...
df_merge['EmployeeId'] = df_merge['EmployeeId'].astype(str)
df_merge = pd.merge(df_merge, df_survey_Q1, on = 'EmployeeId', how='outer')
df_merge = pd.merge(df_merge, df_survey_Q2, on = 'EmployeeId', how='outer')
df_merge = pd.merge(df_merge, df_survey_Q3, on = 'EmployeeId', how='outer')
df_merge = pd.merge(df_merge, df_survey_Q4, on = 'EmployeeId', how='outer')
# outer merge to keep N/As

In [26]:
df_merge

,EmployeeId,CommuteDistance,DegreeCompleted,DegreeField,Department,EmploymentEndDate,EmploymentEndReason,EmploymentStartDate,Gender,JobLevel,...,Salary,TrainingsAttended,TravelFrequency,WeeklyHoursBudgeted,YearOfBirth,PerformanceRating,Q1,Q2,Q3,Q4
0,1001,10,Master,Business,Accounting,NaN,NaN,12/12/2014,Female,4,...,96800,0,None,40,1980,3.000,5.0,3.0,4.0,5.0
1,1002,7,Master,Other,Other,NaN,NaN,10/10/2017,Female,2,...,60400,1,Monthly,40,1986,3.500,5.0,4.0,5.0,5.0
2,1003,9,Bachelor,Business,Other,3/8/2019,Retired,7/23/2014,Male,2,...,49100,2,No travel,40,1992,3.000,3.0,4.0,4.0,4.0
3,1004,8,Master,Other,Marketing,NaN,NaN,5/8/2014,Male,2,...,47100,0,No travel,40,1979,3.600,3.0,3.0,3.0,2.0
4,1005,7,Master,Computer Science,Marketing,NaN,NaN,12/24/2013,Male,4,...,58700,1,Monthly,40,1979,3.000,5.0,3.0,4.0,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1996,2997,12,Master,Business,Accounting,12/17/2019,Went to another company,4/11/2011,Male,3,...,207300,2,Monthly,40,1952,3.125,2.0,3.0,2.0,2.0
1997,2998,17,Master,Finance,Other,NaN,NaN,2/25/2017,Female,1,...,53300,1,Monthly,40,1982,3.000,5.0,4.0,5.0,5.0
1998,2999,3,Master,Marketing,Other,NaN,NaN,10/2/2014,Male,3,...,89300,3,Monthly,40,1972,3.000,5.0,4.0,5.0,5.0
1999,3000,8,Bachelor,Other,Other,NaN,NaN,7/29/2014,Female,3,...,79300,4,monthly,40,1978,3.400,4.0,5.0,4.0,4.0
2000,3001,10,Bachelor,Other,Other,NaN,NaN,12/17/2015,Male,1,...,67500,0,No travel,40,1974,2.250,4.0,3.0,4.0,3.0

In [27]:
# I think we can simplify 'EmploymentEndDate' into employee has left = 'Yes' or 'No'
df_merge['EmploymentEndDate'].dtype

dtype('O')

In [28]:
df_merge['EmploymentEndDate'] = df_merge['EmploymentEndDate'].fillna(0)
df_merge['EmploymentEndReason'] = df_merge['EmploymentEndReason'].fillna(0)

In [29]:
df_merge['EmploymentEndDate'] = np.where(df_merge['EmploymentEndDate'] == 0, 'No', 'Yes')
df_merge['EmploymentEndReason'] = np.where(df_merge['EmploymentEndReason'] == 0, 'Employed', df_merge['EmploymentEndReason'])

In [30]:
df_merge = df_merge.rename(columns ={'EmploymentEndDate' : 'Employed'})

In [31]:
# Understanding # of employed and subcategories for who left

In [32]:
df_merge['Employed'].value_counts()

No     1280
Yes     721
Name: Employed, dtype: int64

In [33]:
df_merge['EmploymentEndReason'].value_counts()

Employed                   1280
Went to another company     397
Retired                     213
Fired                       111
Name: EmploymentEndReason, dtype: int64

In [34]:
# Checking columns we want to include in model:
df_merge.columns

Index(['EmployeeId', 'CommuteDistance', 'DegreeCompleted', 'DegreeField',
       'Department', 'Employed', 'EmploymentEndReason', 'EmploymentStartDate',
       'Gender', 'JobLevel', 'MaritalStatus', 'NumPreviousCompanies',
       'NumYearsWorked', 'OvertimeDays', 'OvertimeHours', 'Salary',
       'TrainingsAttended', 'TravelFrequency', 'WeeklyHoursBudgeted',
       'YearOfBirth', 'PerformanceRating', 'Q1', 'Q2', 'Q3', 'Q4'],
      dtype='object')

In [35]:
# df_merge['EmployeeId'].unique() # Not needed in model
df_merge['CommuteDistance'].unique() # ok
df_merge['DegreeCompleted'].unique() # ok
df_merge['DegreeField'].unique() # ok
df_merge['Department'].unique() # ok
df_merge['Employed'].unique() # *** What we are trying to predict
# df_merge['EmploymentEndReason'].unique() # I don't we should include this its very correlated with what we want to predict
# df_merge['EmploymentStartDate'].unique() # I don't think we need this
df_merge['Gender'].unique()
df_merge['JobLevel'].unique()
df_merge['MaritalStatus'].unique()
df_merge['NumPreviousCompanies'].unique()
df_merge['NumYearsWorked'].unique()
df_merge['OvertimeDays'].unique()
df_merge['OvertimeHours'].unique()
df_merge['Salary'].unique()
df_merge['TrainingsAttended'].unique()
df_merge['TravelFrequency'].unique() # **** These needs to be edited
# df_merge['WeeklyHoursBudgeted'].unique() # All same, not needed
df_merge['YearOfBirth'].unique()
df_merge['PerformanceRating'].unique()
df_merge['Q1'].unique()
df_merge['Q2'].unique()
df_merge['Q3'].unique()
df_merge['Q4'].unique()

array([5., 4., 2., 3., 1.])

In [36]:
# Making lowercase strings for travel freq column
df_merge['TravelFrequency'] = df_merge['TravelFrequency'].str.lower()

In [37]:
df_merge['TravelFrequency'].unique()

array(['none', 'monthly', 'no travel', 'weekly', 'less than monthly'],
      dtype=object)

In [38]:
# Checking columns for N/A

In [39]:
df_merge.isna().sum()

EmployeeId                0
CommuteDistance           0
DegreeCompleted           0
DegreeField              23
Department                0
Employed                  0
EmploymentEndReason       0
EmploymentStartDate       0
Gender                    0
JobLevel                  0
MaritalStatus            68
NumPreviousCompanies    186
NumYearsWorked            0
OvertimeDays              0
OvertimeHours             0
Salary                    0
TrainingsAttended         0
TravelFrequency           0
WeeklyHoursBudgeted       0
YearOfBirth               0
PerformanceRating       369
Q1                        0
Q2                        0
Q3                        0
Q4                        0
dtype: int64

In [40]:
# Dropping N/As
df_merge = df_merge.dropna()

In [41]:
# Check numerical correlations, 'WeeklyHoursBudgeted'
df_merge.corr()

,CommuteDistance,JobLevel,NumPreviousCompanies,NumYearsWorked,OvertimeDays,OvertimeHours,Salary,TrainingsAttended,WeeklyHoursBudgeted,YearOfBirth,PerformanceRating,Q1,Q2,Q3,Q4
CommuteDistance,1.000000,-0.013430,0.042974,0.042218,0.029060,0.017119,0.018483,0.001384,NaN,-0.048347,-0.001761,0.006740,0.011673,0.006863,-0.000267
JobLevel,-0.013430,1.000000,0.248481,0.406115,-0.009064,-0.025618,0.561090,0.001538,NaN,-0.397707,0.036992,0.021495,0.012553,0.018119,0.006499
NumPreviousCompanies,0.042974,0.248481,1.000000,0.717079,-0.009738,0.011214,0.542133,0.038908,NaN,-0.704662,-0.034802,0.011215,0.037746,0.021608,0.002588
NumYearsWorked,0.042218,0.406115,0.717079,1.000000,0.023662,0.042947,0.790944,0.022716,NaN,-0.982940,-0.003156,0.006942,0.025767,0.014857,0.002751
OvertimeDays,0.029060,-0.009064,-0.009738,0.023662,1.000000,0.834372,0.016257,0.025235,NaN,-0.020826,0.032710,0.029174,0.035862,0.029784,0.028558
OvertimeHours,0.017119,-0.025618,0.011214,0.042947,0.834372,1.000000,0.023153,0.031953,NaN,-0.045077,0.004134,0.012571,0.007067,0.009976,0.009246
Salary,0.018483,0.561090,0.542133,0.790944,0.016257,0.023153,1.000000,-0.014001,NaN,-0.778538,-0.004512,0.022112,0.027238,0.018828,0.006781
TrainingsAttended,0.001384,0.001538,0.038908,0.022716,0.025235,0.031953,-0.014001,1.000000,NaN,-0.018438,0.005820,-0.050563,-0.014510,-0.035102,-0.048772
WeeklyHoursBudgeted,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
YearOfBirth,-0.048347,-0.397707,-0.704662,-0.982940,-0.020826,-0.045077,-0.778538,-0.018438,NaN,1.000000,0.008765,-0.001622,-0.024248,-0.013197,0.000323
PerformanceRating,-0.001761,0.036992,-0.034802,-0.003156,0.032710,0.004134,-0.004512,0.005820,NaN,0.008765,1.000000,-0.031438,-0.031784,-0.045556,-0.012861
Q1,0.006740,0.021495,0.011215,0.006942,0.029174,0.012571,0.022112,-0.050563,NaN,-0.001622,-0.031438,1.000000,0.562986,0.758143,0.581003
Q2,0.011673,0.012553,0.037746,0.025767,0.035862,0.007067,0.027238,-0.014510,NaN,-0.024248,-0.031784,0.562986,1.000000,0.738973,0.565486
Q3,0.006863,0.018119,0.021608,0.014857,0.029784,0.009976,0.018828,-0.035102,NaN,-0.013197,-0.045556,0.758143,0.738973,1.000000,0.750318
Q4,-0.000267,0.006499,0.002588,0.002751,0.028558,0.009246,0.006781,-0.048772,NaN,0.000323,-0.012861,0.581003,0.565486,0.750318,1.000000

# Preprocessing

In [42]:
df_merge.columns

Index(['EmployeeId', 'CommuteDistance', 'DegreeCompleted', 'DegreeField',
       'Department', 'Employed', 'EmploymentEndReason', 'EmploymentStartDate',
       'Gender', 'JobLevel', 'MaritalStatus', 'NumPreviousCompanies',
       'NumYearsWorked', 'OvertimeDays', 'OvertimeHours', 'Salary',
       'TrainingsAttended', 'TravelFrequency', 'WeeklyHoursBudgeted',
       'YearOfBirth', 'PerformanceRating', 'Q1', 'Q2', 'Q3', 'Q4'],
      dtype='object')

In [43]:
# Reformatting order of columns, taking out columns we want to exclude
df_merge = df_merge[[
    'Employed', 
    'CommuteDistance', 
    'DegreeCompleted', 
    'DegreeField',
    'Department', 
#     'EmploymentEndReason', 
    'EmploymentStartDate',
    'Gender', 
    'JobLevel', 
    'MaritalStatus', 
    'NumPreviousCompanies',
    'NumYearsWorked', 
    'OvertimeDays', 
    'OvertimeHours', 
    'Salary',
    'TrainingsAttended',
    'TravelFrequency', 
    'YearOfBirth', 
    'PerformanceRating', 
    'Q1', 
    'Q2', 
    'Q3', 
    'Q4']]

In [44]:
# Transforming non-numerical columns into numerical
from sklearn.preprocessing import LabelEncoder

for i in df_merge.columns:
        if df_merge[i].dtype == np.number:
            continue
        df_merge[i] = LabelEncoder().fit_transform(df_merge[i])

<ipython-input-44-3ec55d1e06c6>:5: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df_merge[i].dtype == np.number:

In [45]:
# Setting up independent and depdent variables
X = df_merge.iloc[:, 1:df_merge.shape[1]].values 
Y = df_merge.iloc[:, 0].values

In [46]:
# Split the dataset 
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size = 0.25, random_state = 0)

In [47]:
# Random Forest Classification 
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators = 10, criterion = 'entropy', random_state = 0)
model.fit(X_train, Y_train)

RandomForestClassifier(criterion='entropy', n_estimators=10, random_state=0)

In [48]:
# Accuracy of training
model.score(X_train, Y_train)

0.9789875835721108

In [55]:
#Show the confusion matrix and accuracy for  the model on the test data
#Classification accuracy is the ratio of correct predictions to total predictions made.
from sklearn.metrics import confusion_matrix

cm = confusion_matrix(Y_test, model.predict(X_test))
  
TN = cm[0][0]
TP = cm[1][1]
FN = cm[1][0]
FP = cm[0][1]
  
print(cm)
print('Model Testing Accuracy = "{}!"'.format(  (TP + TN) / (TP + TN + FN + FP)))
print()# Print a new line

[[255  16]
 [ 72   6]]
Model Testing Accuracy = "0.7478510028653295!"

In [57]:
# Return the feature importances (the higher, the more important the feature).
importances = pd.DataFrame({'feature':df_merge.iloc[:, 1:df_merge.shape[1]].columns,'importance':np.round(model.feature_importances_,3)}) #Note: The target column is at position 0
importances = importances.sort_values('importance',ascending=False).set_index('feature')
importances

                      importance
feature
EmploymentStartDate        0.096
Salary                     0.091
NumYearsWorked             0.078
PerformanceRating          0.075
YearOfBirth                0.070
CommuteDistance            0.069
OvertimeHours              0.066
OvertimeDays               0.064
DegreeField                0.044
NumPreviousCompanies       0.039
TravelFrequency            0.039
Q4                         0.035
TrainingsAttended          0.033
Q3                         0.032
Department                 0.030
JobLevel                   0.029
Q2                         0.028
Q1                         0.025
DegreeCompleted            0.022
MaritalStatus              0.021
Gender                     0.015